---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DesignOption
source: html/406603aa-ed4c-3f8c-1a1f-0bc3ae91128c.htm
---
# DesignOption Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.